app/views/giftcard/order.html.erb

        <tbody>
            <% Giftcoupon.all.each do |giftcoupon|%>
---
SELECT "giftcoupons".* FROM "giftcoupons"

                        <td><%=giftcoupon.first_name + " " + giftcoupon.last_name%></td>
                        <td><%=giftcoupon.order_date%></td>
---
SELECT "orders".* FROM "orders"