app/controllers/register_controller.rb

INSERT INTO "users" ("email", "username", "password_digest", "created_at", "updated_at", "role") VALUES (?, ?, ?, ?, ?, ?)
---
    def create
        @user = User.new(user_params)
        @user.role = 0

        if @user.save